CFD Projects/Channel Flow/CFD_ChannelFlow_Project/laminarChannel/constant/turbulenceProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      turbulenceProperties;
}

simulationType  laminar;
